run/tutorials/coflowFlame/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

Ufuel		uniform (0 0  0.5);
Ucoflow		uniform (0 0  0.5);

internalField   $Ucoflow;

boundaryField
{
    inletfuel           
    {
	type            fixedValue;
        value           $Ufuel;
    }
    inletair           
    {
	type            fixedValue;
        value           $Ucoflow;
    }
    outlet       
    {
        type            zeroGradient;
    }
    leftside      
    {
        type            fixedValue;
	value		$Ucoflow;
    }
    burnerwall			   
    {
	type            fixedValue;
        value           uniform (0 0 0);
    }
    axis			   
    {
        type            empty;
    }
    front   
    {
        type            wedge;
    }
    back  
    {
        type            wedge;
    }
}


// ************************************************************************* //
