run/tutorials/coflowFlame/0/Z
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      binary;
    class       volScalarField;
    location    "0";
    object      csi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletfuel
    {
        type            fixedValue;
        value           uniform 1;
    }
    inletair
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    leftside
    {
        type            zeroGradient;
    }
    burnerwall			   
    {
	type            zeroGradient;
    }
    axis			   
    {
        type            empty;
    }
    front   
    {
        type            wedge;
    }
    back  
    {
        type            wedge;
    }
}


// ************************************************************************* //
